08-rails/moma/app/views/artists/show.html.erb


<% @artist.works.each do |work| %>
---
SELECT "works".* FROM "works" WHERE "works"."artist_id" = ?  [["artist_id", 25]]