08-rails/moma/app/views/works/show.html.erb

  <li>Title: <%= @work.title %></li>
  <% if @work.artist.present? %>
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]