08-rails/moma/app/controllers/artists_controller.rb

  def create
    artist = Artist.create artist_params #secured params of the form
---
INSERT INTO "artists" ("name", "nationality", "dob", "period", "image") VALUES (?, ?, ?, ?, ?)  [["name", "Mai"], ["nationality", "Vietnam"], ["dob", "1992-10-04"], ["period", "Millinion"], ["image", ""]]

  def edit
    @artist = Artist.find params[:id]
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

  def update
    artist = Artist.find params[:id]
    artist.update artist_params
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "artists" SET "nationality" = ? WHERE "artists"."id" = ?  [["nationality", "Vietn"], ["id", 25]]

  def show
    @artist = Artist.find params[:id]
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

  def destroy
    artist = Artist.find params[:id]
    artist.destroy
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
DELETE FROM "artists" WHERE "artists"."id" = ?  [["id", 10]]