08-rails/moma/app/controllers/works_controller.rb

SELECT "works".* FROM "works"
---
  def index
    @works = Work.all

INSERT INTO "works" ("title", "year", "medium", "style", "image") VALUES (?, ?, ?, ?, ?)  [["title", ""], ["year", ""], ["medium", ""], ["style", ""], ["image", "https://cdn.mos.cms.futurecdn.net/jbCNvTM4gwr2qV8X8fW3ZB.png"]]
---
  def create
    work = Work.create work_params

SELECT  "works".* FROM "works" WHERE "works"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @work = Work.find params[:id]

SELECT  "works".* FROM "works" WHERE "works"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "works" SET "artist_id" = ? WHERE "works"."id" = ?  [["artist_id", 28], ["id", 24]]
---
  def update
    work = Work.find params[:id]
    work.update work_params

SELECT  "works".* FROM "works" WHERE "works"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @work = Work.find params[:id]

SELECT  "works".* FROM "works" WHERE "works"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "works" WHERE "works"."id" = ?  [["id", 9]]
---
  def destroy
    work = Work.find params[:id]
    work.destroy