08-rails/solar_system/app/controllers/planets_controller.rb

SELECT "planets".* FROM "planets"
---
  def index
    @planets = Planet.all

SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
  def show
    @planet = Planet.find params[:id]

INSERT INTO "planets" ("name", "image") VALUES (?, ?)  [["name", "Mai"], ["image", ""]]
---
  def create
    planet = Planet.create :name => params[:name], :image => params[:image], :orbit => params[:orbit], :diameter => params[:diameter], :mass => params[:mass], :distance_from_earth => params[:distance_from_earth], :moons => params[:moons]

SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
  def edit
    @planet = Planet.find params[:id]

SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "planets" SET "image" = ?, "diameter" = ? WHERE "planets"."id" = ?  [["image", ""], ["diameter", 234554.0], ["id", 10]]
---
  def update
    planet = Planet.find params[:id]
    planet.name = params[:name]
    planet.image = params[:image]
    planet.orbit = params[:orbit]
    planet.diameter = params[:diameter]
    planet.mass = params[:mass]
    planet.distance_from_earth = params[:distance_from_earth]
    planet.moons = params[:moons]
    planet.save

SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
DELETE FROM "planets" WHERE "planets"."id" = ?  [["id", 19]]
---
  def destroy
    planet = Planet.find params[:id]
    planet.destroy #Alderaan: delete