08-rails/tunr/app/controllers/mixtapes_controller.rb

INSERT INTO "mixtapes" ("title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Lala"], ["user_id", 9], ["created_at", "2021-01-22 00:32:50.585870"], ["updated_at", "2021-01-22 00:32:50.585870"]]
---
  def create
    # @current_user.mixtapes.create mixtape_params ## ALTERNATIVE
    mixtape = Mixtape.create mixtape_params ## create