08-rails/tunr/app/controllers/session_controller.rb

  def create
    #find the user BY EMAIL ADDRESS
    user = User.find_by :email => params[:email]
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "craigsy@ga.co"], ["LIMIT", 1]]