08-rails/tunr/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?)
---
  def create
    @user = User.create user_params # TODO: handle errors